/*                                ОПИСАНИЕ:

Этот скрипт запускается после сканирования 1_Scanning.js
берёт таблицу resultScan.xlsx, загружает данные из неё во внутренние массивы

Затем, для каждой лиги, проходит по всем ставкам на события в ней
Заходит на соответствующий сайт с рейтиногм
И находит порядковые номера в рейтинговом списке, для каждого названия команды

Далее - сохраняет эту информацию, и передаёт управление обратно в скрипт 2_ProcessingScanning.js
Который правильно её обрабатывает, и добавляет записи в таблицу всех ставок MainBetsTable.xlsx
А также необходимые события в TaskTable.xlsx

*/



















































